
&После("ПриЗаписи")
Процедура Работа_С_Заказами_ПриЗаписи(Отказ, Замещение)
	
	Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	Если ТипЗнч(Регистратор) <> Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
	   И ТипЗнч(Регистратор) <> Тип("ДокументСсылка.ПоступлениеТоваровНаСклад")
	   И ТипЗнч(Регистратор) <> Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
	   И ТипЗнч(Регистратор) <> Тип("ДокументСсылка.ОприходованиеИзлишковТоваров")
	   И ТипЗнч(Регистратор) <> Тип("ДокументСсылка.СборкаТоваров")
	   И ТипЗнч(Регистратор) <> Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Возврат;
	КонецЕсли;
	
	О_Работа_С_Заказами.ОбработатьСобытиеОГотовностиКОтгрузке(Регистратор);
	
КонецПроцедуры
