
&НаСервере
Процедура Работа_С_Заказами_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если О_Работа_С_Заказами.СкорректироватьСписокГеквизитовШабонаСообщения(Реквизиты, Объект.Ссылка) Тогда
		Элементы.ТемаПисьма.ТолькоПросмотр								= Истина;
		Элементы.Наименование.ТолькоПросмотр							= Истина;
		Элементы.ПолноеИмяТипаПараметраВводаНаОсновании.ТолькоПросмотр	= Истина;
		Элементы.СтраницыЗаголовокПараметры.Видимость					= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&Вместо("РезультатПроверкиШаблоны")
Функция Работа_С_Заказами_РезультатПроверкиШаблоны()
	
	ПараметрыШаблона = ШаблоныСообщенийСлужебный.ПараметрыШаблона(Объект);
	СведенияОШаблоне = ШаблоныСообщенийСлужебный.СведенияОШаблоне(ПараметрыШаблона);
	
//ООООООООООООООООООООООООООООООООООООООО	
	О_Работа_С_Заказами.СкорректироватьСписокГеквизитовШабонаСообщения(СведенияОШаблоне.Реквизиты.Строки, Объект.Ссылка);
//ООООООООООООООООООООООООООООООООООООООО	
	
	ОшибочныеРеквизиты = Новый Массив;
	ПараметрыТекстаСообщения = ШаблоныСообщенийСлужебный.ПараметрыИзТекстаСообщения(ПараметрыШаблона);
	ШаблоныСообщенийСлужебный.ОпределитьОшибочныеРеквизиты(ПараметрыТекстаСообщения, ОшибочныеРеквизиты, СведенияОШаблоне);
	
	ТекстОшибки = "";
	Если ОшибочныеРеквизиты.Количество() > 0 Тогда
		ТекстОшибки = ?(ОшибочныеРеквизиты.Количество() = 1,
			НСтр("ru = 'Некорректный реквизит в шаблоне сообщения:'"),
			НСтр("ru = 'Некорректные реквизиты в шаблоне сообщения:'")) + " ";
		Разделитель = "";
		Для каждого ОшибочныйРеквизит Из ОшибочныеРеквизиты Цикл
			ТекстОшибки = ТекстОшибки + Разделитель + СокрЛП(ОшибочныйРеквизит);
			Разделитель = ", ";
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТекстОшибки;
	//Результат = ПродолжитьВызов();
	//Возврат Результат;
КонецФункции
