
&НаСервере
Процедура Работа_С_Заказами_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если О_Работа_С_Заказами.ЭтоПредопределенныйВидОповещения(Объект.Ссылка) Тогда
		Элементы.Наименование.ТолькоПросмотр						= Истина;
		Элементы.ГруппаРассылокИОповещений.ТолькоПросмотр			= Истина;
		Элементы.ТипСобытия.ТолькоПросмотр							= Истина;
		Элементы.ПредназначенаДляЭлектронныхПисем.ТолькоПросмотр	= Истина;
		Элементы.ШаблонЭлектронногоПисьма.ТолькоПросмотр			= Истина;
		Элементы.ПредназначенаДляSMS.ТолькоПросмотр					= Истина;
		Элементы.ШаблонСообщенияSMS.ТолькоПросмотр					= Истина;
		Элементы.ИспользуетсяУсловиеОтправки.Видимость				= Ложь;
		Элементы.ИзменитьФормулу.Видимость							= Ложь;
		Элементы.СтраницаРасписание.Видимость						= Ложь;
		Элементы.СтраницаУсловие.Видимость							= Ложь;
		ЭтотОбъект.КоманднаяПанель.Видимость						= Ложь;
	КонецЕсли;
КонецПроцедуры
