
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НадоСохранить = Ложь;
	
	СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("Обработка.ОповещенияПриРаботеСЗаказами.Форма.Форма","СтруктураНастроек");
	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		
		ЭтотОбъект.ШаблоныСообщений.Загрузить(СтруктураНастроек.ТаблицаШаблонов);
		
		ПредопределенныеВидыОповещений = СоздатьПредопределенныеШаблоныНаСервере();
		Если ПредопределенныеВидыОповещений.Количество() > 0 Тогда
			Для Каждого СтрокаТаблицы Из ЭтотОбъект.ШаблоныСообщений Цикл
				Если СокрЛП(СтрокаТаблицы.ГруппаРассылокИОповещений.Наименование) = "" Тогда
					Для Каждого ВидОповещения Из ПредопределенныеВидыОповещений Цикл
						Если СокрЛП(СтрокаТаблицы.НаименованиеГруппыРассылокИОповещений) = СокрЛП(ВидОповещения.ГруппаРассылокИОповещений.Наименование) Тогда
							СтрокаТаблицы.ГруппаРассылокИОповещений = ВидОповещения.ГруппаРассылокИОповещений;
							НадоСохранить = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если СокрЛП(СтрокаТаблицы.ВидОповещения.Наименование) = "" Тогда
					Для Каждого ВидОповещения Из ПредопределенныеВидыОповещений Цикл
						Если СокрЛП(СтрокаТаблицы.НаименованиеВидаОповещения) = СокрЛП(ВидОповещения.Наименование) Тогда
							СтрокаТаблицы.ВидОповещения = ВидОповещения;
							НадоСохранить = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если СокрЛП(СтрокаТаблицы.Шаблон.Наименование) = "" Тогда
					Для Каждого ВидОповещения Из ПредопределенныеВидыОповещений Цикл
						Если ВидОповещения.ПредназначенаДляSMS Тогда
							Шаблон = ВидОповещения.ШаблонСообщенияSMS;
						Иначе	
							Шаблон = ВидОповещения.ШаблонЭлектронногоПисьма;
						КонецЕсли;
						Если СокрЛП(СтрокаТаблицы.НаименованиеШаблона) = СокрЛП(Шаблон.Наименование) Тогда
							СтрокаТаблицы.Шаблон = Шаблон;
							НадоСохранить = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			ДатаНачалаОтслеживанияГотовностиЗаказовКОтгрузке		= СтруктураНастроек.ДатаНачалаОтслеживанияГотовностиЗаказовКОтгрузке;
		Исключение
		КонецПопытки;
		Попытка
			ОдинДокументСообщениеSMSОтправляетSMSОдномуАдресату		= СтруктураНастроек.ОдинДокументСообщениеSMSОтправляетSMSОдномуАдресату;
		Исключение
		КонецПопытки;
		Попытка
			СоздаватьЗадачиМенеджерамПриПолныхОплатахЗаказов		= СтруктураНастроек.СоздаватьЗадачиМенеджерамПриПолныхОплатахЗаказов;
		Исключение
		КонецПопытки;
		Попытка
			СоздаватьЗадачиМенеджерамПриГотовностиЗаказовКОтгрузке	= СтруктураНастроек.СоздаватьЗадачиМенеджерамПриГотовностиЗаказовКОтгрузке;
		Исключение
		КонецПопытки;
		Попытка
			ОтправлятьОповещенияКлиентамПриОплатеЗаказовНаличными	= СтруктураНастроек.ОтправлятьОповещенияКлиентамПриОплатеЗаказовНаличными;
		Исключение
		КонецПопытки;
		Попытка
			ДнейБесплатногоХраненияТоваров							= СтруктураНастроек.ДнейБесплатногоХраненияТоваров;
		Исключение
			ДнейБесплатногоХраненияТоваров							= 3;
		КонецПопытки;
		
	Иначе
		
		ДнейБесплатногоХраненияТоваров								= 3;
		Попытка
			ДатаНачалаОтслеживанияГотовностиЗаказовКОтгрузке		= ТекущаяДата();
		Исключение
		КонецПопытки;
		
		ЗаполнитьТаблицуПредопределеннымиШаблонамиНаСервере();
		
		НадоСохранить = Истина;
		
	КонецЕсли;
	
	Если НадоСохранить Тогда
		СохранитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ТаблицаШаблонов1 = ШаблоныСообщений.Выгрузить();
	СтруктураНастроек = Новый Структура("ТаблицаШаблонов", ТаблицаШаблонов1); 
	
	СтруктураНастроек.Вставить("ДатаНачалаОтслеживанияГотовностиЗаказовКОтгрузке", ДатаНачалаОтслеживанияГотовностиЗаказовКОтгрузке);
	
	СтруктураНастроек.Вставить("ОдинДокументСообщениеSMSОтправляетSMSОдномуАдресату", ОдинДокументСообщениеSMSОтправляетSMSОдномуАдресату);
	СтруктураНастроек.Вставить("ОтправлятьОповещенияКлиентамПриОплатеЗаказовНаличными", ОтправлятьОповещенияКлиентамПриОплатеЗаказовНаличными);
	
	СтруктураНастроек.Вставить("СоздаватьЗадачиМенеджерамПриГотовностиЗаказовКОтгрузке", СоздаватьЗадачиМенеджерамПриГотовностиЗаказовКОтгрузке);
	СтруктураНастроек.Вставить("СоздаватьЗадачиМенеджерамПриПолныхОплатахЗаказов", СоздаватьЗадачиМенеджерамПриПолныхОплатахЗаказов);
	СтруктураНастроек.Вставить("ДнейБесплатногоХраненияТоваров", ДнейБесплатногоХраненияТоваров);
	
	СпрПользователи = Справочники.Пользователи.Выбрать();
	Пока СпрПользователи.Следующий() Цикл
		Если СпрПользователи.Служебный Тогда
			Продолжить;
		КонецЕсли;
		ПользИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(СпрПользователи.ИдентификаторПользователяИБ);
		Если ПользИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ХранилищеОбщихНастроек.Сохранить("Обработка.ОповещенияПриРаботеСЗаказами.Форма.Форма","СтруктураНастроек", СтруктураНастроек,, ПользИБ.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Функция СоздатьПредопределенныеШаблоныНаСервере()
	Возврат О_Работа_С_Заказами.СоздатьПредопределенныеШаблоныСообщений();
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуПредопределеннымиШаблонамиНаСервере()
	
	ПредопределенныеВидыОповещений = СоздатьПредопределенныеШаблоныНаСервере();
	Если ПредопределенныеВидыОповещений.Количество() > 0 Тогда
		ШаблоныСообщений.Очистить();
		Для Каждого ВидОповещения Из ПредопределенныеВидыОповещений Цикл
			Если ВидОповещения.ПредназначенаДляSMS Тогда
				Шаблон = ВидОповещения.ШаблонСообщенияSMS;
			Иначе	
				Шаблон = ВидОповещения.ШаблонЭлектронногоПисьма;
			КонецЕсли;
			НоваяСтрока = ШаблоныСообщений.Добавить();
			НоваяСтрока.Шаблон									= Шаблон;
			НоваяСтрока.Назначение								= Шаблон.Назначение;
			НоваяСтрока.НаименованиеШаблона						= Шаблон.Наименование;
			НоваяСтрока.ПредназначенДляSMS						= Шаблон.ПредназначенДляSMS;
			НоваяСтрока.ПредназначенДляЭлектронныхПисем			= Шаблон.ПредназначенДляЭлектронныхПисем;
			НоваяСтрока.ВидОповещения							= ВидОповещения;	
			НоваяСтрока.НаименованиеВидаОповещения				= ВидОповещения.Наименование;	
			НоваяСтрока.ГруппаРассылокИОповещений				= ВидОповещения.ГруппаРассылокИОповещений;	
			НоваяСтрока.НаименованиеГруппыРассылокИОповещений	= ВидОповещения.ГруппаРассылокИОповещений.Наименование;	
			Если СокрЛП(Шаблон.Наименование) = "Оплата заказа клиента (полная, SMS клиенту)" Тогда
				НоваяСтрока.ДляКого		= "Для клиента";	
				НоваяСтрока.ТипСобытия	= "Оплата";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Оплата заказа клиента (частичная, SMS клиенту)" Тогда
				НоваяСтрока.ДляКого		= "Для клиента";	
				НоваяСтрока.ТипСобытия	= "Оплата";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Оплата заказа клиента (полная, SMS менеджеру)" Тогда
				НоваяСтрока.ДляКого		= "Для менеджера";	
				НоваяСтрока.ТипСобытия	= "Оплата";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Оплата заказа клиента (частичная, SMS менеджеру)" Тогда
				НоваяСтрока.ДляКого		= "Для менеджера";	
				НоваяСтрока.ТипСобытия	= "Оплата";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Оплата заказа клиента (полная, письмо клиенту)" Тогда
				НоваяСтрока.ДляКого		= "Для клиента";	
				НоваяСтрока.ТипСобытия	= "Оплата";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Оплата заказа клиента (частичная, письмо клиенту)" Тогда
				НоваяСтрока.ДляКого		= "Для клиента";	
				НоваяСтрока.ТипСобытия	= "Оплата";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Оплата заказа клиента (полная, письмо менеджеру)" Тогда
				НоваяСтрока.ДляКого		= "Для менеджера";	
				НоваяСтрока.ТипСобытия	= "Оплата";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Оплата заказа клиента (частичная, письмо менеджеру)" Тогда
				НоваяСтрока.ДляКого		= "Для менеджера";	
				НоваяСтрока.ТипСобытия	= "Оплата";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Товары по заказу клиента готовы (SMS клиенту)" Тогда
				НоваяСтрока.ДляКого		= "Для клиента";	
				НоваяСтрока.ТипСобытия	= "ОбеспеченностьТоварами";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Товары по заказу клиента готовы (SMS менеджеру)" Тогда
				НоваяСтрока.ДляКого		= "Для менеджера";	
				НоваяСтрока.ТипСобытия	= "ОбеспеченностьТоварами";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Товары по заказу клиента готовы (письмо клиенту)" Тогда
				НоваяСтрока.ДляКого		= "Для клиента";	
				НоваяСтрока.ТипСобытия	= "ОбеспеченностьТоварами";	
			ИНачеЕсли СокрЛП(Шаблон.Наименование) = "Товары по заказу клиента готовы (письмо менеджеру)" Тогда
				НоваяСтрока.ДляКого		= "Для менеджера";	
				НоваяСтрока.ТипСобытия	= "ОбеспеченностьТоварами";	
			КонецЕсли;
		КонецЦикла;
		ШаблоныСообщений.Сортировать("НаименованиеВидаОповещения");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуПредопределеннымиШаблонами(Команда)
	ЗаполнитьТаблицуПредопределеннымиШаблонамиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныСообщенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Элемент.ТекущиеДанные.Шаблон);
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, Неопределено,
								Неопределено,, Неопределено, Неопределено, Неопределено);
КонецПроцедуры
